Repository: Alhiane/ValidatorKit
Catalog: Sources/ValidatorKit/Resources/Localization/*.lproj/Localizable.strings
Languages: ar, es, fr

# validation.custom
source: Validation failed.
ar: فشلت عملية التحقق.
es: La validación falló.
fr: La validation a échoué.

# validation.email
source: Please enter a valid email address.
ar: يرجى إدخال عنوان بريد إلكتروني صالح.
es: Por favor, introduce una dirección de correo electrónico válida.
fr: Veuillez saisir une adresse e-mail valide.

# validation.min
source: Value must be at least %@.
ar: يجب أن تكون القيمة على الأقل %@.
es: El valor debe ser al menos %@.
fr: La valeur doit être au moins %@.

# validation.max
source: Value must be no more than %@.
ar: يجب ألا تتجاوز القيمة %@.
es: El valor no debe exceder %@.
fr: La valeur ne doit pas dépasser %@.

# validation.numeric
source: Please enter a numeric value.
ar: يرجى إدخال قيمة رقمية.
es: Por favor, introduce un valor numérico.
fr: Veuillez saisir une valeur numérique.

# validation.date
source: Please enter a valid date.
ar: يرجى إدخال تاريخ صالح.
es: Por favor, introduce una fecha válida.
fr: Veuillez saisir une date valide.

# validation.range
source: Value must be between %@ and %@.
ar: يجب أن تكون القيمة بين %@ و %@.
es: El valor debe estar entre %@ y %@.
fr: La valeur doit être entre %@ et %@.

# validation.pattern
source: Value does not match the required pattern.
ar: القيمة لا تتطابق مع النموذج المطلوب.
es: El valor no coincide con el patrón requerido.
fr: La valeur ne correspond pas au modèle requis.

# validation.url
source: Please enter a valid URL.
ar: يرجى إدخال عنوان URL صالح.
es: Por favor, introduce una URL válida.
fr: Veuillez saisir une URL valide.

# validation.inArray
source: Value must be one of the allowed options.
ar: يجب أن تكون القيمة واحدة من الخيارات المسموح بها.
es: El valor debe ser una de las opciones permitidas.
fr: La valeur doit être l'une des options autorisées.

# validation.requiredIf
source: This field is required based on the specified condition.
ar: هذا الحقل مطلوب بناءً على الشرط المحدد.
es: Este campo es obligatorio según la condición especificada.
fr: Ce champ est obligatoire en fonction de la condition spécifiée.

# validation.required
source: This field is required.
ar: هذا الحقل مطلوب.
es: Este campo es obligatorio.
fr: Ce champ est obligatoire.

# validation.greaterThan
source: Value must be greater than %@.
ar: يجب أن تكون القيمة أكبر من %@.
es: El valor debe ser mayor que %@.
fr: La valeur doit être supérieure à %@.

# validation.lessThan
source: Value must be less than %@.
ar: يجب أن تكون القيمة أقل من %@.
es: El valor debe ser menor que %@.
fr: La valeur doit être inférieure à %@.

# validation.mimeTypes
source: File type must be one of the allowed types: %@.
ar: يجب أن يكون نوع الملف واحدًا من الأنواع المسموح بها: %@.
es: El tipo de archivo debe ser uno de los tipos permitidos: %@.
fr: Le type de fichier doit être l'un des types autorisés : %@.
